{
  "breadcrumb": {
    "president": "President business gifts",
    "discover": "Discover",
    "shop": "Shop",
    "account": "Account",
    "news": "News",
    "about": "About us",
    "category": "Category",
    "collections": "Collections",
    "corporategifts": "Corporate gifts"
  },
  "navbar": {
    "changelangg": "Change language",
    "changelocale": "Select another location"
  },
  "showcase": {
    "title": "Premium and exclusive gifts",
    "description": "Heraldic watches, leather goods, accessories and national souvenirs — in limited and branded versions",
    "button": "Submit request"
  },
  "news": {
    "title": "News",
    "newArrival": "coming soon"
  },

  "productVideos": {
    "title": "Product Videos"
  },
  "support": {
    "title": "Leave a request",
    "supportform": "Leave a request and our manager will contact you shortly to clarify all the details and select the perfect gift.",
    "form": {
      "name": {
        "label": "Name",
        "placeholder": "Enter your name"
      },
      "phone": {
        "label": "Phone number",
        "placeholder": "Enter your phone number"
      },
      "submit": "Send request"
    },
    "messages": {
      "required": "This field is required",
      "min": "Must be at least {min} characters",
      "max": "Must be less than {max} characters",
      "invalid": "Invalid format",
      "success": "✅ Your message has been sent successfully!",
      "error": "❌ Failed to send the message. Please try again.",
      "serverError": "⚠️ Something went wrong. Try again later!",
      "modalSuccessTitle": "Thank you! Your request has been successfully submitted.",
      "modalSuccessDescription": "The President Business Gifts team will contact you shortly. We look forward to providing you with the best service."
    }
  },

  "location": {
    "title": "Branches",
    "text": "Addresses"
  },
  "footer": {
    "footerDescription": "President Business Gifts is not just a brand. It is the art of gift giving that reflects attention and prestige. Each product is a symbol of status and respect for detail.",
    "signUp": "Sign up",
    "support": "SUPPORT",
    "company": "COMPANY",
    "newProducts": "New Products",
    "acceptedPayments": "ACCEPTED PAYMENTS",
    "socialMedia": "SOCIAL MEDIA",
    "copyright": "© 2025 President Business Gifts. All rights reserved."
  },
  "createpage": {
    "title": "Coming Soon",
    "description": "We are building something extraordinary for you. Our full website experience is launching soon.",
    "returnMessage": "Please return to our homepage in the meantime.",
    "buttonText": "Visit our Homepage"
  },
  "account": {
    "accountTitle": "Account detail",
    "fullName": "Full name",
    "email": "Email",
    "enterEmail": "Enter your email",
    "submit": "Submit"
  },
  "homepage": {
    "more": "More"
  },
  "collections": {
    "title": "Collections",
    "newArrival": "View collection"
  },

  "story": {
    "story": "STORY"
  },
  "about": {
    "title": "Our Story",
    "subtitle": "President Business Gifts",
    "description": "The President Business Gift brand started its journey in 2017 and by 2021 had firmly established itself in the market of exclusive corporate gifts. In just a few years, we have become a reliable partner for companies, government institutions, and private clients who value status, style, and high quality.",
    "imageAlt": "President Business Gifts is not just a premium gift brand",
    "infoText1": "Today, President Business Gift is not just a store, but a leader in the field of premium gifts for businessmen and executives. We offer a wide range of exclusive wristwatches, handcrafted leather goods, gift sets with custom engraving, VIP accessories, business notebooks, fountain pens, and souvenirs with a national touch.",
    "infoText2": "We are rapidly expanding our presence and confidently entering new markets. We do not stop at what we have achieved — each day, the brand 'President Business Gifts' becomes more and more recognizable. Soon, the whole world will know about us."
  },

  "category": {
    "title": "Categories",
    "new": "New Arrival",
    "not_found": "Product not found",
    "unavailable": "Unfortunately, this product is currently unavailable. We will add it to the catalog soon. Please check back later.",
    "show_more": "Show more"
  },
  "sortAndView": {
    "productsLabel": "products",
    "sortBy": "Sort by:",
    "options": {
      "newest": "Newest",
      "priceAsc": "Price: Low to High",
      "priceDesc": "Price: High to Low"
    }
  },
  "corporategifts": {
    "title": "Corporate gifts",
    "text": "We also deal with corporate gifts with your logo - watches, leather sets, notebooks, pens and other souvenirs. We have already cooperated with banks, companies and government organizations - we select gifts according to their needs, carry out full branding and packaging",
    "btn": "Read more",
    "desc": "President Business Gifts is not just a product showcase – it's a true immersion into the world of aesthetics, inspiration, and premium gifts. In our showroom, you can personally see exclusive items that combine national heritage and modern design, evaluate their quality, and find the perfect gift for yourself or your partners. If you want to feel the philosophy of our brand – be sure to visit our showroom. You can find the address and location on this page. If you have any questions or want to schedule a meeting in advance – feel free to contact us anytime.",
    "headerTitle": "The Art of Corporate Gifting",
    "headerText": "Corporate gifts with your company logo are not just a formality. They’re a powerful tool for business communication and brand reputation. At President Business Gift, we create gifts that show respect, care, and prestige from your company to executives, partners, and corporate clients.",
    "block1": {
      "title": "Branded gifts in your company style",
      "subtitle": "<ul><li>Wristwatches with your logo or emblem</li><li>Leather goods (wallets, clutches, cardholders, bags) with embossed logos</li><li>Customized notebooks and engraved pens</li><li>Gift sets for executives and VIP guests</li><li>Plaques and souvenirs with national symbols</li></ul>"
    },
    "block2": {
      "title": "Personalization and custom approach",
      "subtitle": "Each gift can be tailored to your corporate identity. We use laser engraving, embossing, and gold foiling technologies. This gives your gift a premium and personal touch. Personalized corporate gifts show special attention to your partners, clients, or employees."
    },
    "block3": {
      "title": "When to give corporate gifts?",
      "subtitle": "<ul><li>On company anniversaries</li><li>After successful deals</li><li>On national and public holidays</li><li>To motivate key clients or employees</li><li>In honor of promotions, awards, or appointments</li></ul>"
    },
    "block4": {
      "title": "Why choose President Business Gift?",
      "subtitle": "<ul><li>Over 8 years of experience in premium B2B gifts</li><li>Trusted partner for banks, government entities, large corporations</li><li>Delivery across Central Asia and personal support</li><li>European production technologies and quality control</li><li>Gifts that inspire admiration, respect, and trust</li></ul>"
    }
  },
  "catalog": {
    "title": "Catalog",
    "description": "President Business Gifts is not just a premium gift brand, but a unique blend of national identity and modern aesthetics. Inspired by the historical heritage, cultural richness, and craftsmanship traditions of the Uzbek people, we harmoniously combine them with modern design and the highest standards of quality."
  },
  "finewatch": {
    "breadcrumb": "Honoring the Minerva Legacy",
    "maintext": "At President Business Gifts, we don't just create gifts — we create values. Each product goes through a journey from idea to perfect execution under the supervision of our team.\nWe design everything ourselves, select premium materials, and control every step of production.",
    "title": "Honoring the Minerva Legacy",
    "rightSideTitle": "Craftsmanship in Every Detail",

    "craftsmanship": {
      "productType": "Craftsmanship",
      "description": "Aesthetic and technical excellence",
      "textInfo": "Our watches feature precise Japanese and Swiss movements, and for leather goods, we use only selected genuine leather with high durability. Every stitch, engraving, and detail is manually refined so that the final product reflects quality, prestige, and respect."
    },
    "engineering": {
      "productType": "Engineering",
      "description": "A mechanism presented to the world",
      "textInfo": "We source parts from trusted suppliers, but all assembly, branding, and packaging is carried out according to our own unique standards. The result is a product that represents your attention and taste."
    },
    "innovation": {
      "productType": "Innovation",
      "description": "Advanced technology in every detail",
      "textInfo": "We apply modern processing, testing, and branding technologies to ensure each item is not only beautiful but also durable. Thanks to precise engineering, integration of new solutions, and design expertise — you receive a product that combines tradition, style, and technology."
    }
  },
  "careandservices": {
    "title": "Product Care and Services"
  },
  "careServices": {
    "writing": "Writing Instrument",
    "leather": "Leather",
    "watches": "Watches"
  },
  "service": {
    "title": "Customer Service",
    "shipping": {
      "title": "Delivery and Shipping",
      "description": "We strive to deliver your order as quickly and conveniently as possible.",
      "delivery_tashkent_title": "Within Tashkent:",
      "delivery_tashkent_text": "Delivery is carried out via Yandex Delivery on the same day the order is placed. You will receive your gift within a few hours after confirmation.",
      "delivery_regions_title": "Across the regions of Uzbekistan:",
      "delivery_regions_text": "Orders are shipped via BTS delivery service. Delivery time is from 2 to 7 business days depending on the city and the remoteness of the pickup point.",
      "contact_text": "For all delivery-related questions, you can contact our unified call center:",
      "contact_phone": "+998 71 203 05 00"
    },
    "return": {
      "title": "Product Warranty",
      "text1": "We are confident in the quality of our products and provide a warranty for them.",
      "text2": "Each product with a warranty comes with a warranty card.",
      "text3": "To receive warranty service, you must keep the warranty card and the receipt.",
      "text4": "The warranty period ranges from 2 to 5 years, depending on the product type and operating conditions."
    }
  }
}
