{
  "breadcrumb": {
    "president": "Подарки для бизнеса President"
  },
  "navbar": {
    "changelangg": "Изменить язык",
    "changelocale": "Выбрать другое местоположение"
  },
  "showcase": {
    "title": "Премиум и эксклюзивные подарки",
    "description": "Гербовые часы, кожаные изделия, аксессуары и национальные сувениры — в лимитированных и брендированных вариантах",
    "button": "Оставить заявку"
  },
  "news": {
    "title": "Новости",
    "newArrival": "Заказать сейчас"
  },

  "productVideos": {
    "title": "Видеоролики о продуктах"
  },
  "support": {
    "title": "Оставьте заявку",
    "supportform": "Оставьте заявку — и наш менеджер свяжется с вами в ближайшее время, чтобы уточнить все детали и подобрать идеальный подарок.",
    "form": {
      "name": {
        "label": "Имя",
        "placeholder": "Введите ваше имя"
      },
      "phone": {
        "label": "Номер телефона",
        "placeholder": "Введите ваш номер телефона"
      },
      "submit": "Отправить запрос"
    },
    "messages": {
      "required": "Это поле обязательно для заполнения",
      "min": "Минимум {min} символов",
      "max": "Максимум {max} символов",
      "invalid": "Неверный формат",
      "success": "✅ Ваше сообщение успешно отправлено!",
      "error": "❌ Не удалось отправить сообщение. Пожалуйста, попробуйте еще раз.",
      "serverError": "⚠️ Что-то пошло не так. Попробуйте позже!",
      "modalSuccessTitle": "Спасибо! Ваша заявка успешно отправлена.",
      "modalSuccessDescription": "В ближайшее время с вами свяжется команда President Business Gifts. Мы рады предоставить вам лучшее обслуживание!"
    }
  },

  "location": {
    "title": "Филиалы",
    "text": "Адреса"
  },
  "footer": {
    "footerDescription": "President Business Gifts — это\nне просто бренд. Это искусство\nдарить с достоинством. Всё, что\nподчеркивает статус и внимание\nк деталям.\n",
    "signUp": "Регистрация",
    "support": "ПОДДЕРЖКА",
    "company": "КОМПАНИЯ",
    "newProducts": "Новые продукты",
    "acceptedPayments": "ПРИНИМАЕМЫЕ ПЛАТЕЖИ",
    "socialMedia": "СОЦИАЛЬНЫЕ СЕТИ",
    "copyright": "© 2025 President Business Gifts. Все права защищены."
  },
  "createpage": {
    "title": "Скоро открытие",
    "description": "Мы создаем что-то необыкновенное для вас. Наш полноценный веб-сайт скоро запустится.",
    "returnMessage": "Пожалуйста, вернитесь на нашу главную страницу.",
    "buttonText": "Посетите нашу главную страницу"
  },
  "account": {
    "accountTitle": "Детали аккаунта",
    "fullName": "Полное имя",
    "email": "Электронная почта",
    "enterEmail": "Введите вашу почту",
    "submit": "Отправить"
  },
  "homepage": {
    "more": "Подробнее"
  },
  "collections": {
    "title": "Коллекции",
    "newArrival": "Посмотреть коллекцию"
  },

  "story": {
    "story": "ИСТОРИЯ"
  },
  "about": {
    "title": "Наша история",
    "subtitle": "President Business Gifts",
    "description": "Бренд President Business Gift начал свою деятельность в 2017 году и уже с 2021 года активно заявил о себе на рынке эксклюзивных корпоративных подарков. За считаные годы мы превратились в надёжного партнёра для компаний, государственных структур и частных клиентов, которые ценят статус, стиль и высокое качество.",
    "imageAlt": "President Business Gifts — это не просто бренд премиальных подарков",
    "infoText1": "Сегодня President Business Gift — это не просто магазин, а лидер в сфере премиальных подарков для бизнесменов и руководителей. Мы предлагаем богатый ассортимент: от эксклюзивных наручных часов и кожаных изделий ручной работы до подарочных наборов с фирменной гравировкой, VIP-аксессуаров, деловых блокнотов, перьевых ручек и сувениров с национальным акцентом.",
    "infoText2": "Мы стремительно расширяем своё присутствие и уверенно выходим на новые рынки. Мы не останавливаемся на достигнутом — с каждым днём бренд “President Business Gifts” становится всё более узнаваемым. Совсем скоро о нас узнает весь мир."
  },
  "category": {
    "title": "Категории",
    "new": "Новое поступление",
    "not_found": "Товар не найден",
    "unavailable": "К сожалению, данный товар в данный момент недоступен. Мы скоро добавим его в каталог. Пожалуйста, загляните позже.",
    "show_more": "Показать ещё"
  },
  "sortAndView": {
    "productsLabel": "Продукты",
    "sortBy": "Сортировать по:",
    "options": {
      "newest": "Новейший",
      "priceAsc": "Цена: по возрастанию",
      "priceDesc": "Цена: по убыванию"
    }
  },
  "corporategifts": {
    "title": "Корпоративные подарки",
    "text": "Мы также занимаемся корпоративными подарками с вашим логотипом - часы, кожаные наборы, блокноты, ручки и другие сувениры. Мы уже сотрудничаем с банками, компаниями и государственными организациями - подбираем подарки под их потребности, осуществляем полное брендирование и упаковку.",
    "btn": "Подробнее",
    "desc": "President Business Gifts — это не просто демонстрация продукции, а настоящее погружение в мир эстетики, вдохновения и премиальных подарков. В нашем шоуруме вы сможете лично увидеть эксклюзивные изделия, сочетающие национальное наследие и современный дизайн, оценить их качество и подобрать идеальный подарок для себя или партнёров. Если вы хотите прочувствовать философию нашего бренда — обязательно посетите наш шоурум. Адрес и местоположение вы найдёте на этой странице. Если у вас возникнут вопросы или вы хотите заранее назначить встречу — свяжитесь с нами в любое удобное время.",
    "headerTitle": "Искусство корпоративного подарка",
    "headerText": "Корпоративные подарки с логотипом компании — это не просто формальность. Это мощный инструмент деловой коммуникации и укрепления имиджа. В President Business Gift мы создаём подарки для бизнесменов, руководителей и корпоративных клиентов, которые выражают уважение, внимание и статус от лица вашей компании.",
    "block1": {
      "title": "Подарки с фирменным стилем вашей компании",
      "subtitle": "<ul><li>Наручные часы с логотипом вашей организации или гербом</li><li>Кожаные изделия (портмоне, клатчи, визитницы, сумки) с тиснением логотипа</li><li>Персонализированные блокноты и ручки с гравировкой</li><li>Подарочные наборы для руководителей и VIP-гостей</li><li>Плакеты и сувенирные изделия с национальной символикой</li></ul>"
    },
    "block2": {
      "title": "Индивидуальный подход и персонализация",
      "subtitle": "Каждое изделие можно адаптировать под ваш фирменный стиль. Мы используем технологии лазерной гравировки, тиснения и золочения. Это придаёт подарку эксклюзивность и делает его личным. Корпоративные подарки с индивидуальным дизайном — это знак особого внимания к вашим партнёрам, клиентам или сотрудникам."
    },
    "block3": {
      "title": "Когда дарить корпоративные подарки?",
      "subtitle": "<ul><li>На юбилеи компании</li><li>По итогам успешной сделки</li><li>На государственные и национальные праздники</li><li>Для мотивации сотрудников и ключевых клиентов</li><li>В честь назначений, награждений и переходов на новую должность</li></ul>"
    },
    "block4": {
      "title": "Почему выбирают President Business Gift?",
      "subtitle": "<ul><li>Более 8 лет опыта в премиум-сегменте B2B-подарков</li><li>Надёжный партнёр для банков, госструктур, крупных корпораций</li><li>Доставка по всей Центральной Азии и индивидуальное сопровождение</li><li>Производство по европейским технологиям и высокий контроль качества</li><li>Подарки, которые вызывают восхищение, уважение и доверие</li></ul>"
    }
  },
  "catalog": {
    "title": "Каталог",
    "description": "President Business Gifts — это не просто бренд премиальных подарков, а уникальное сочетание национальной идентичности и совремённой эстетики. Вдохновляясь историческим наследием, культурным богатством и ремесленными традициями узбекского народа, мы гармонично объединяем их с современным дизайном и высочайшими стандартами качества."
  },
  "finewatch": {
    "breadcrumb": "Почитание наследия Minerva",
    "maintext": "В President Business Gifts мы создаём не просто подарки — мы создаём ценности. Каждое изделие проходит путь от идеи до идеального исполнения под контролем нашей команды.\nМы самостоятельно разрабатываем дизайн, подбираем материалы премиального уровня и контролируем каждый этап производства.",
    "title": "Почитание наследия Minerva",
    "rightSideTitle": "Мастерство в каждой детали",

    "craftsmanship": {
      "productType": "Мастерство",
      "description": "Эстетическое и техническое совершенство",
      "textInfo": "Наши часы оснащаются точнейшими японскими и швейцарскими механизмами, а для кожаных изделий мы используем только отборную натуральную кожу с высоким индексом износостойкости. Каждый шов, каждая гравировка, каждая деталь проходит ручную доработку, чтобы финальный продукт стал отражением качества, престижа и уважения."
    },
    "engineering": {
      "productType": "Инженерия",
      "description": "Механизм, представленный миру",
      "textInfo": "Мы заказываем детали у проверенных поставщиков, но весь процесс сборки, брендирования и упаковки проходит по нашим уникальным стандартам. Это — продукт, созданный нами, под наш бренд и с нашим контролем качества. В результате — изделия, которые становятся визитной карточкой вашего внимания и вкуса."
    },
    "innovation": {
      "productType": "Инновации",
      "description": "Высокие технологии — в каждой детали",
      "textInfo": "Мы применяем современные технологии обработки, тестирования и брендирования, чтобы каждая вещь была не просто красивой, но и долговечной. Благодаря точной инженерии, интеграции новых решений и дизайнерской экспертизе — вы получаете продукт, в котором сочетаются традиции, стиль и технологичность."
    }
  },
  "careandservices": {
    "title": "Уход за изделиями и сервис"
  },
  "careServices": {
    "writing": "Письменный инструмент",
    "leather": "Кожаные изделия",
    "watches": "Часы"
  },
  "service": {
    "title": "Обслуживание клиентов"
  }
}
